{
  "books": [
    {
      "id": 1,
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "genre": "Fiction",
      "price": 12.99,
      "description": "It tells the story of a young girl named Scout Finch growing up in a small town in Alabama during the 1930s. The novel deals with themes of racism, prejudice, and social inequality, as Scout's father, a lawyer named Atticus Finch, defends a black man accused of raping a white woman. Through Scout's eyes, the reader is shown the injustices of the segregated society and the bravery of those who stand up against it.",
      "pages": 336
    },
    {
      "id": 2,
      "title": "1984",
      "author": "George Orwell",
      "genre": "Dystopian Fiction",
      "price": 9.99,
      "description": "It is set in a totalitarian society in which the government, led by the figurehead Big Brother, exercises complete control over the lives of its citizens. The novel explores themes of political oppression, censorship, and the dangers of totalitarianism, and is often seen as a warning against the abuses of power.",
      "pages": 328
    },
    {
      "id": 3,
      "title": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "genre": "Coming-of-Age Fiction",
      "price": 8.99,
      "description": "It follows the story of Holden Caulfield, a disillusioned teenager who has been expelled from his prep school and wanders around New York City for several days before returning home. The novel deals with themes of alienation, adolescence, and the loss of innocence, and has become a classic of American literature.    ",
      "pages": 277
    },
    {
      "id": 4,
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "genre": "Romance",
      "price": 6.99,
      "description": "It tells the story of Elizabeth Bennet, a strong-willed and independent woman, and her romantic relationship with the wealthy and proud Mr. Darcy. The novel explores themes of love, marriage, and social class, and is often seen as a satire of the social norms and values of Regency England. It is considered one of Austen's most popular and enduring works.",
      "pages": 336
    },
    {
      "id": 5,
      "title": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "genre": "Literary Fiction",
      "price": 10.99,
      "description": "It tells the story of Jay Gatsby, a wealthy and mysterious man who throws lavish parties in the hopes of winning back his lost love, Daisy Buchanan. The novel deals with themes of love, wealth, and the corruption of the American Dream, and is often seen as a reflection of the Jazz Age and the excesses of the Roaring Twenties.    ",
      "pages": 180
    },
    {
      "id": 6,
      "title": "Moby-Dick",
      "author": "Herman Melville",
      "genre": "Adventure",
      "price": 13.99,
      "description": "It tells the story of Captain Ahab's obsessive quest to kill the giant white whale that has taken his leg. The novel deals with themes of revenge, obsession, and the struggle between man and nature, and is often seen as a commentary on the human condition and the quest for knowledge.",
      "pages": 704
    },
    {
      "id": 7,
      "title": "The Adventures of Huckleberry Finn",
      "author": "Mark Twain",
      "genre": "Adventure",
      "price": 7.99,
      "description": "It tells the story of a young boy named Huck Finn who runs away from his abusive father and sets out on a journey down the Mississippi River with a runaway slave named Jim. The novel deals with themes of race, morality, and the hypocrisy of society, and is often seen as a commentary on the institution of slavery in America.",
      "pages": 366
    },
    {
      "id": 8,
      "title": "One Hundred Years of Solitude",
      "author": "Gabriel Garcia Marquez",
      "genre": "Magical Realism",
      "price": 11.99,
      "description": "It tells the story of the Buendia family and their life in the fictional town of Macondo, spanning over several generations. The novel deals with themes of time, memory, and the cyclical nature of history, and is often seen as a masterpiece of magical realism.",
      "pages": 417
    },
    {
      "id": 9,
      "title": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "genre": "Fantasy",
      "price": 19.99,
      "description": "A sweeping epic of good vs. evil in a fully realized imaginary world filled with unforgettable characters.",
      "pages": 1178
    },

    {
      "id": 10,
      "title": "The Hitchhiker's Guide to the Galaxy",
      "author": "Douglas Adams",
      "genre": "Science Fiction",
      "price": 5.99,
      "description": "A hilarious and irreverent romp through space and time, featuring a hapless human and his alien friend.",
      "pages": 224
    },
    {
      "id": 11,
      "title": "In Search of Lost Time",
      "author": "Marcel Proust",
      "genre": "Fiction",
      "price": 15.99,
      "description": "A seven-volume masterpiece of modernist literature, exploring the themes of memory, time, and society in fin-de-siècle France.",
      "pages": 4215
    },
    {
      "id": 12,
      "title": "Anna Karenina",
      "author": "Leo Tolstoy",
      "genre": "Realistic Fiction",
      "price": 9.99,
      "description": "A sweeping novel of love, adultery, and family set against the backdrop of 19th-century Russia.",
      "pages": 864
    },
    {
      "id": 13,
      "title": "War and Peace",
      "author": "Leo Tolstoy",
      "genre": "Historical Fiction",
      "price": 12.99,
      "description": "A panoramic novel of the Napoleonic Wars and the society that fought them, featuring dozens of memorable characters.",
      "pages": 1392
    },
    {
      "id": 14,
      "title": "The Brothers Karamazov",
      "author": "Fyodor Dostoevsky",
      "genre": "Philosophical Fiction",
      "price": 11.99,
      "description": "A complex and compelling novel exploring themes of faith, reason, and morality through the lives of three brothers in 19th-century Russia.",
      "pages": 824
    },
    {
      "id": 15,
      "title": "Riders in the Chariot",
      "author": "Patrick White",
      "genre": "Modernist Fiction",
      "price": 8.99,
      "description": "A haunting novel about four isolated characters in post-World War II Australia, seeking transcendence amidst the mundanity of their lives.",
      "pages": 528
    },
    {
      "id": 16,
      "title": "Don Quixote",
      "author": "Miguel de Cervantes",
      "genre": "Satire",
      "price": 10.99,
      "description": "A classic novel about a delusional knight-errant who sets out to revive chivalry in 17th-century Spain.",
      "pages": 992
    },
    {
      "id": 17,
      "title": "Madame Bovary",
      "author": "Gustave Flaubert",
      "genre": "Realistic Fiction",
      "price": 9.99,
      "description": "A controversial novel about a dissatisfied wife in 19th-century France, who seeks escape from her provincial life through extramarital affairs and material possessions.",
      "pages": 368
    },
    {
      "id": 18,
      "title": "Crime and Punishment",
      "author": "Fyodor Dostoevsky",
      "genre": "Psychological Thriller",
      "price": 11.99,
      "description": "A dark and brooding novel about a young man in St. Petersburg who commits a murder and struggles with guilt and redemption.",
      "pages": 544
    },
    {
      "id": 19,
      "title": "Catch-22",
      "author": "Joseph Heller",
      "genre": "Satire",
      "price": 8.99,
      "description": "A satirical novel about the absurdities of war, following the exploits of a bombardier in World War II.",
      "pages": 544
    }
  ]
}
